Конфигурация/DataProcessors/ПечатьЗаявокНаПроплатуНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЗаявокНаПроплатуНалога</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/НачислениеДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеДивидендов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.Доли</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДивидендыНаЦеннуюБумагу</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаДивиденды</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбъявленная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьЗаявокНаПроплатуНалога/Forms/ФормаВыбораСобытия/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, ЭтаФорма.Параметры, "Организация, Дата");
	
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА НачислениеДивидендов.ЦеннаяБумага ЕСТЬ NULL
	|			ТОГДА ""Оплата налога по расчету НДФЛ""
	|		ИНАЧЕ ""Оплата налога с дивидендов""
	|	КОНЕЦ КАК ВидСобытия,
	|	НачислениеДивидендов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КодыВоВнешнихСистемахСрезПоследних.Код КАК ИдСобытия
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(&ПериодНачало, &ПериодКонец, Регистратор, ) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|		ПО ОстаткиДенежныхСредств.Регистратор = ЗадолженностиПоДенежнымСредствамОбороты.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
	|		ПО (НачислениеЗадолженностиОснования.Ссылка = ЗадолженностиПоДенежнымСредствамОбороты.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетНДФЛ.Основания КАК РасчетНДФЛОснования
	|		ПО (РасчетНДФЛОснования.Ссылка = НачислениеЗадолженностиОснования.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаДивидендовОснования
	|		ПО (ОплатаДивидендовОснования.Ссылка = РасчетНДФЛОснования.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеДивидендов КАК НачислениеДивидендов
	|		ПО (&СтруктураЗависимости2025
	|					И ОплатаДивидендовОснования.Основание = НачислениеДивидендов.Ссылка
	|				ИЛИ НЕ &СтруктураЗависимости2025
	|					И ЗадолженностиПоДенежнымСредствамОбороты.Основание = НачислениеДивидендов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
	|				&ПериодКонец,
	|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.НРД)
	|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.КорпоративноеСобытиеПоВыплатеДивидендов)) КАК КодыВоВнешнихСистемахСрезПоследних
	|		ПО (НачислениеДивидендов.Ссылка = КодыВоВнешнихСистемахСрезПоследних.Объект)
	|ГДЕ
	|	ОстаткиДенежныхСредств.Организация = &Организация
	|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаПрибыль))
	|	И ОстаткиДенежныхСредств.Период МЕЖДУ &ПериодНачало И &ПериодКонец"; 
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(Объект.Дата));   
	Если Объект.Дата < Дата(2025, 1, 1) Тогда                        
	// Начисление Дивидендов
	//  |_ Оплата Дивидендов
	//  |_ Начисление задолженности по НДФЛ
	//  |_ Оплата НДФЛ

		Запрос.УстановитьПараметр("СтруктураЗависимости2025", Ложь);  
	Иначе  
	// новая структура подчиненности с 2025 г.  
	// Начисление Дивидендов
	//  |_ Оплата Дивидендов
	//    |_ Расчет НДФЛ
	//      |_ Начисление задолженности по НДФЛ
	//        |_ Оплата НДФЛ           

		Запрос.УстановитьПараметр("СтруктураЗависимости2025", Истина);  
	КонецЕсли;	
	
	ЭтаФорма.ПараметрыСобытия.Загрузить(Запрос.Выполнить().Выгрузить());	
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда				
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ВозращаемыеДанные(ИсточникДанных)
	
	Результат = Новый Структура("ЦеннаяБумага, ВидСобытия, ИдСобытия");
	ЗаполнитьЗначенияСвойств(Результат, ИсточникДанных);
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ВыбратьСобытие(Команда)
	
	ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.Элементы.ПараметрыСобытия.ТекущиеДанные);
	ЭтаФорма.Закрыть(ТекущиеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПараметрыСобытия.Количество() = 1 Тогда 
		Отказ = Истина;
		ТекущиеПараметры = ВозращаемыеДанные(ЭтаФорма.ПараметрыСобытия[0]);		
		ЭтаФорма.Закрыть(ТекущиеПараметры);
	ИначеЕсли ЭтаФорма.ПараметрыСобытия.Количество() = 0 Тогда  
		// нет начислений
		Отказ = Истина;
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСобытияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьСобытие(Команды.Найти("ВыбратьСобытие"));
КонецПроцедуры
